{
  "name": "halfinamoon",
  "headerTaglineOne": "🌙",
  "headerTaglineTwo": "I'm Heru Mulyana -",
  "headerTaglineThree": "ponderer and developer",
  "headerTaglineFour": "moving by writing.",
  "showCursor": false,
  "showBlog": true,
  "darkMode": true,
  "showResume": true,
  "socials": [
    { "id": "1", "title": "Github", "link": "https://github.com/herukan" },
    {
      "id": "2",
      "title": "LinkedIn",
      "link": "https://linkedin.com/in/herukan"
    },
    { "id": "3", "title": "Twitter", "link": "https://x.com/halfinamoon" },
    { "id": "4", "title": "Medium", "link": "https://medium.com/@halfinamoon" },
    { "id": "5", "title": "Email", "link": "mailto:heru842@gmail.com" }
  ],
  "projects": [],
  "services": [],
  "aboutpara": "I am Heru, a Versatile and Creative problem-solver nurtured by collaborations with fellow Co-Researchers, Doctors, Stakeholders, and Software Engineer in my few years of experience of delivering solutions to solve complex technical challenges. Integrity and Assertive enthusiasm I’ve devoted in every project is the necessity to Implement Machine Learning Solution to the Production level, through my adaptability across Frontend, Mobile, and Backend technology stack to generate effective design solutions.",
  "resume": {
    "tagline": "👋  I am Heru, a Versatile and Creative problem-solver",
    "description": "Solver is nurtured by collaborations with fellow Co-Researchers, Doctors, Stakeholders, and Software Engineer in my few years of experience of delivering solutions to solve complex technical challenges. Integrity and Assertive enthusiasm I’ve devoted in every project is the necessity to Implement Machine Learning Solution to the Production level, through my adaptability across Frontend, Mobile, and Backend technology stack to generate effective design solutions.",
    "experiences": [
      {
        "id": "1",
        "dates": "Aug 2018 - Jun 2021",
        "type": "Contract",
        "position": "Machine Learning and Software Engineer",
        "bullets": "Designing and Developing Machine Learning and Deep Learning Systems, with a proven track record in implementing appropriate ML algorithms to the production level., Developed UI prototypes and design documentation and developed it into Viable Product., Designing and Developing Fullstack and Mobile App various backend and frontend frameworks. ,Successfully created 2 Minimum Viable Product along with their Intellectual Property Rights. ,Presenting the innovation and creativity of the Products into the International and National scientific conferences as an oralist., Demonstrated expertise in running Machine Learning tests and experiments optimizing systems to achieve up to 93% accuracy., Conducted System Usability Scale (SUS) testing on an application receiving positive feedback from respondents (medical students and otorhinolaryngologists)"
      },
      {
        "id": "d495c23b-4f65-479a-9b8a-cfbc1c089725",
        "dates": "Sept 2018 – Nov 2018",
        "type": "Contract",
        "position": "Full-Stack Software Engineer",
        "bullets": "Designing and Developing Fullstack Web Application using various backend and frontend frameworks, Nurtured by collaborative Governmental teamwork that embracing assertive communication and analytical skills, Thoroughly understanding governmental need through desk research and interviews including a comprehensive competitive analysis to identify strengths and weaknesses of the client, Develop and manage a customer database including police number transaction number active date and customer's balance., Maintain and improve the Vehicle Rent and Maintenance System, ensuring smooth operations and user-friendly interfaces"
      }
    ],
    "publication": [
      {
        "id": "1",
        "dates": "Issued Nov 17, 2018 ",
        "type": "Patent office Indonesia, number id 000125174",
        "position": "Researcher and Software Engineer",
        "bullets": "Pornographic Image Detection Application Using the Convolutional Neural Network Model for Android-Based Smartphones"
      },
      {
        "id": "d495c23b-4f65-479a-9b8a-cfbc1c089725",
        "dates": "Issued Sep 1, 2019",
        "type": "Patent office Indonesia, number id 000154185",
        "position": "Researcher and Software Engineer",
        "bullets": "Porn Away (Application to Detect and Quarantine Porn Pictures and Videos on Android Smart Devices)"
      },
      {
        "id": "d495c23b-4f65-479a-9b8a-cfbc1c089745",
        "dates": "Issued 2021",
        "type": "Citation H Kadriyan et al 2021 IOP Conf. Ser.: Earth Environ. Sci. 712012022",
        "position": "Researcher and Software Engineer",
        "bullets": "Ear disease determination on computer-assisted outer and middle ear images"
      }
    ],
    "education": {
      "universityName": "Bachelor of Informatics Engineering",
      "universityDate": "2015-2020",
      "universityPara": "University of Mataram / Lombok, Graduated with G.P.A of 3.12 Out of 4.0"
    },
    "languages": ["Python", "R", "Kotlin", "Javascript", "Java"],
    "frameworks": [
      "Tensorflow",
      "Pytorch",
      "React",
      "Laravel",
      "Flask",
      "Flutter"
    ],
    "others": ["Tableu", "Obsidian"]
  }
}
